{
  "version": "2026-01-29T03:59:19.466Z",
  "whatsNew": "SRCS LMS – Release v.10.3 RC (Performance, AI, & UI Overhaul)\n\nExperience the Future of Learning: The Neo-Glass Era\nWe believe that educational tools shouldn't just be functional—they should be beautiful, immersive, and inspiring. With SRCS LMS v10.3, we aren't just pushing code; we are redefining how you interact with your digital campus.\n\nThis update introduces our boldest design language yet: Neo-Glass. We have moved beyond flat surfaces to create a deep, cinematic interface where content floats on layers of light and blur. From the moment you launch the app, you’ll be greeted by a living, breathing dashboard that adapts to your device’s theme, glowing with the dynamic colors of your own personal aesthetic. Every interaction, from the fluid ripple of a button press to the smooth glide of a modal, has been engineered to feel instantaneous and organic.\n\nWe have also fundamentally rebuilt the mobile experience. The days of fighting with keyboards covering your chat or jittery scrolling are over. The new interface respects every pixel of your screen, offering a native-app feel that fits perfectly in the palm of your hand. Whether you are approving schedules or engaging in the student lounge, the interface now responds with the precision and fluidity you expect from world-class software.\n\nSecurity has also taken a quantum leap forward without compromising speed. You can now unlock your entire workspace with a simple touch or glance using our new Biometric Authentication. It is the perfect blend of fortress-grade security and effortless convenience, ensuring your data remains yours while getting you to your classroom in milliseconds.\n\nThis isn't just an update; it’s a promise of a smoother, faster, and more stunning way to teach and learn. Welcome to the new standard.\n\n🚀 How to Access\n📱 For Mobile Users:\n\nInstall: Download the new 10.3 RC build.\n\nAuthorize: Sign in using your standard faculty credentials (if asked).\n\nNote: If a 'Play Protect' prompt appears, select 'More Details' → 'Install Anyway'.\n\n💻 For Desktop Users:\nAccess the LMS directly from your browser for a full-screen management experience: 👉 https://srcsdigital.dpdns.org/\n\nThank you for helping us build the future of Learning Management Systems!"
}