{
  "version": "2025-11-05T16:45:20.273Z",
  "whatsNew": "===============================\n   S R C S   L M S\n   R E L E A S E   N O T E S\n   (November Update)\n===============================\n\n### Bug Fixes & Core Logic Improvements\n\n* **Fixed Quiz Retake Bug:** Addressed a critical bug where students retaking a quiz (assigned via a new post) would see their old scores.\n* **Unique Post IDs:** Re-engineered quiz and lesson submission logic to use the `postId` as a unique identifier. This ensures every new assignment is treated as a fresh entry, allowing for proper retakes.\n* **Teacher Score View Fixed:** Updated the teacher's `QuizScoresModal` to filter submissions by `postId`, ensuring teachers only see scores relevant to the specific post they are viewing.\n* **Lesson XP Fix:** Applied the same `postId` logic to lesson completions. Students now correctly earn XP for a lesson *each time* it is assigned in a new post, rather than just once.\n\n\n### UI Enhancements\n\n* **New Badge Icons:** Replaced the previous emoji-based badge icons with a new, aesthetically pleasing set from the Lucide React library for a cleaner, more professional look on the Profile and Dashboard pages.\n* **Dark Mode:** Dark mode is now fully supported across the application. \n\n\n### Gamification Features\n\n* Added core gamification features for students. \n* (Note: The Lesson XP Fix above also enhances this feature.)\n\n\n### Security and Anti-Cheating (Quiz)\n\n* **Student Watermark:** Added a dynamic watermark with the student's name to the quiz interface. 4]\n* **Disabled Copy/Paste:** Implemented a feature to prevent students from copying, pasting, or cutting content during a quiz. \n* **Developer Tools Detection:** Implemented a more robust mechanism to detect when a user opens the browser's developer tools.\n* **Enhanced Security:** The combination of these features enhances the integrity of the quiz environment.\n\n\n### Performance and Stability\n\n* Conducted a general audit to identify and address potential memory leaks. \n* Ensured all components with event listeners and timers have proper cleanup functions. \n* Optimized the `UnitAccordion` component by memoizing child components and using `useCallback` to reduce unnecessary re-renders. \n\n\n### AI Engine\n\n* Adopted a triple AI-engine model to ensure seamless processing."
}