{
  "version": "2026-01-17T09:59:36.932Z",
  "whatsNew": "SRCS LMS – Release v.10.1 RC (Performance & AI Overhaul)\n\"Building the future of education through superior engineering.\"\n\nWe heard your feedback on dashboard fluidity. In this release, we stripped down the heavy animation engines and rebuilt the core scrolling mechanics to deliver a 60fps, zero-lag experience. We also aligned our AI tools with DepEd standards for a fairer, smarter classroom assistant.\n\n✨ Headlining Features\n1. 🚀 \"Butter Smooth\" Performance (Major Overhaul)\nWe optimized the app's rendering engine to respect your device's battery and processing power.\n\nZero-Lag Scrolling: We removed heavy Framer Motion calculations from the Activity Feed. Scrolling through hundreds of announcements is now instantaneous and lightweight.\n\nSmart Rendering: The dashboard now uses content-visibility technology. The app intelligently \"pauses\" rendering for off-screen widgets, drastically reducing memory usage and device heating.\n\nInstant Startup: We fixed a layout blocking issue (removed useLayoutEffect) that caused a split-second \"stutter\" during login. The dashboard now paints immediately.\n\n2. 🧠 AI Intelligence Upgrade\nDepEd-Aligned Quiz Generation: We fixed the AI logic to ensure all generated quizzes strictly align with DepEd standards. This guarantees content fairness, appropriate difficulty levels, and cultural relevance for your students.\n\nSmarter Google Slides: The \"Text-to-Presentation\" engine has an updated prompt structure. Expect clearer slide layouts, better topic structuring, and enhanced visuals for both Teacher lessons and Student reports.\n\n3. 🎨 Visuals & Stability\nRefined UI: We tweaked the \"Glassmorphism\" effects to be easier on the eyes and the GPU. The interface retains its modern look but with better text readability and stability.\n\nCrash Prevention: We consolidated how modals (pop-ups) are handled to prevent overlaps and potential crashes during rapid navigation.\n\n🚀 How to Access\n📱 For Mobile Users:\n\nInstall: Download the new 10.1 RC build.\n\nAuthorize: Sign in using your standard faculty credentials (if asked).\n\nNote: If a 'Play Protect' prompt appears, select 'More Details' → 'Install Anyway'.\n\n💻 For Desktop Users:\nAccess the LMS directly from your browser for a full-screen management experience: 👉 https://srcsdigital.web.app/\n\nThank you for helping us build the future of Learning Management Systems!"
}